#include <iostream>

using namespace std;

int main()
{
    int n, i, j, k, count=0;

    cin>>n;
    /*
    //以下方案会超时
    //10元兑换所有可能情况
    for(i=0; i<=n/10; ++i)
    {
        //20元兑换所有可能情况
        for(j=0; j<=n/20; ++j)
        {
            //50元兑换所有可能情况
            for(k=0; k<=n/50; ++k)
            {
                if(n==10*i+20*j+50*k)
                {
                    ++count;
                }
            }
        }
    }
    */
    /*以下方案又超时了
    //减少一层循环
    //10元兑换所有可能情况
    for(i=0; i<=n/10; ++i)
    {
        //20元兑换所有可能情况
        for(j=0; j<=n/20; ++j)
        {
            //如果剩下的钱能被50整除
            k = n-10*i-20*j;
            if(k>=0 && k%50==0)
            {
                ++count;
            }
        }
    }
    */
    /*以下方案又超时了
    //减少一层循环
    //10元兑换所有可能情况
    for(i=0; i<=n; i+=10)
    {
        //20元兑换所有可能情况
        for(j=0; j<=n; j+=20)
        {
            //如果剩下的钱能被50整除
            k = n-i-j;
            //如果剩下的钱少于0，则break
            if(k<0)
                break;
            if(k>=0 && k%50==0)
            {
                ++count;
            }
        }
    }
    */
    /*又超时了。。。*/
    //减少一层循环
    //50元兑换所有可能情况
    for(i=0; i<=n; i+=50)
    {
        //20元兑换所有可能情况
        for(j=0; j<=n; j+=20)
        {
            k = n-i-j;
            //如果剩下的钱少于0，则break
            if(k<0)
                break;
            //剩下的钱一定是10的倍数，所以不要再取模
            ++count;
        }
    }

    cout<<count<<endl;
    return 0;
}
